added anomaly_model.py and also updated test_integration file, README.md file of blackbox module
